import random
a= ["萬機","直諫","逸豫","色荒","注擬","感疾","告暇","梁柱","椽榱","榮衛","雲霄","溝壑","溷濁","請託","黜陟","故舊","區區","朱顔","玉齒","菅蒯","伶俜","綽約","沙汀","自適","薦枕","傴僂","蒼茫","嵯峨","膏粱","邪佞","衰病","嚴君","防秋","藍縷","愚陋","婚姻","赴防","伉儷","枯槁","偕老","都雅","鼓噪","彎弓","生致","擒斬","馬鞍","慷慨","方冊","中謝","文思","勤儉","宵旰","鼎崻","忠邪","三長","發露","勸戒","安危","遟暮","昏蒙","操筆","狂簡","醬瓿","形開","大悲","啓齒","粲然","倦憊","假寢","半面","同穴之友","藜藿","落魄","懸鶉","歔欷","壺漿","紅顔","桑梓","芝蘭","柳絮","飄風","鬢髮","懺滌","蒼顔","黃粱","臧否","蛾眉","季妹","追封","錦裙","遊幸","昵侍","傳宣","午忌日","蹴鞠","襟紐","積薪","浮屠","謬錯","崖岸"]
while a!=0:
	input("")
	print(random.choice(a))

	
